Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: If we decline to accept these assumptions, and judge these issues based on ordinary commonsense morality while placing the users first, we arrive at very different conclusions.
de: Wenn wir diese Annahmen ablehnen zu akzeptieren und diese Probleme auf Grundlage des gesunden Menschenverstandes moralisch ‑ Benutzerinnen und Benutzer an erster Stelle ‑ beurteilen, kommen wir zu ganz anderen Schlussfolgerungen.

source: Computer users should be free to modify programs to fit their needs, and free to share software, because helping other people is the basis of society.
de: Rechnernutzer sollten Programme entsprechend ihren Bedürfnissen anpassen und mit anderen teilen können, denn anderen Menschen zu helfen ist die Grundlage der Gesellschaft.

source: There is no room here for an extensive statement of the reasoning behind this conclusion, so I refer the reader to the web pages http://www.gnu.org/philosophy/why-free.html and http://www.gnu.org/philosophy/free-software-even-more-important.html.
de: Es würde den Rahmen dieses Dokuments sprengen, die Gründe für diese Schlussfolgerung ausführlich darzulegen, möchte aber auf die Artikel Warum Software keine Eigentümer haben sollte und Freie Software ist jetzt sogar noch wichtiger verweisen.

source: A stark moral choice With my community gone, to continue as before was impossible.
de: Eine gänzlich moralische Entscheidung Mit dem Verlust meiner Gemeinschaft war es unmöglich weiterzumachen wie zuvor.

source: Instead, I faced a stark moral choice.
de: Stattdessen stand ich vor einer gänzlich moralischen Entscheidung.

source: The easy choice was to join the proprietary software world, signing nondisclosure agreements and promising not to help my fellow hacker.
de: Die einfachste Entscheidung wäre wohl gewesen, der proprietären Softwarewelt beizutreten, Vertraulichkeitsvereinbarungen zu unterzeichnen und zu versprechen, meinen Mithackern nicht mehr zu helfen.

source: Most likely I would also be developing software that was released under nondisclosure agreements, thus adding to the pressure on other people to betray their fellows too.
de: Sehr wahrscheinlich würde ich auch Software entwickeln, die unter Vertraulichkeitsvereinbarungen freigegeben wäre und somit den Druck auf andere Menschen erhöhen, ihre Mitmenschen auch zu verraten.

source: I could have made money this way, and perhaps amused myself writing code.
de: Ich hätte auf diese Weise Geld gemacht und mich vielleicht mit dem Schreiben von Quellcode vergnügen können.

source: But I knew that at the end of my career, I would look back on years of building walls to divide people, and feel I had spent my life making the world a worse place.
de: Aber ich wusste, dass ich am Ende meiner Karriere auf Jahre des Mauerbauens, um Menschen zu spalten, zurückblicken und das Gefühl haben würde, mein Leben damit verbracht zu haben, die Welt zu einem noch schlimmeren Ort gemacht zu haben.

source: I had already experienced being on the receiving end of a nondisclosure agreement, when someone refused to give me and the MIT AI Lab the source code for the control program for our printer.
de: Ich hatte bereits Erfahrung damit, am empfangenden Ende einer Vertraulichkeitsvereinbarung zu sein, als sich jemand weigerte, mir und dem MIT AI Lab den Quellcode für das Steuerprogramm unseres Druckers zu geben (der Mangel bestimmter Fähigkeiten in diesem Programm machte den Gebrauch des Druckers äußerst frustrierend).

source: (The lack of certain features in this program made use of the printer extremely frustrating.) So I could not tell myself that nondisclosure agreements were innocent.
de: Also konnte ich mir selbst nicht mehr sagen, dass Vertraulichkeitsvereinbarungen unschuldig waren. Ich war sehr verärgert, als er sich weigerte mit uns zu teilen.

source: I was very angry when he refused to share with us; I could not turn around and do the same thing to everyone else.
de: Ich konnte mich nicht einfach umdrehen und dasselbe mit anderen machen.

source: Another choice, straightforward but unpleasant, was to leave the computer field.
de: Eine andere Alternative, einfach aber unangenehm, war der Rechnerwelt den Rücken zukehren.

source: That way my skills would not be misused, but they would still be wasted.
de: Auf diese Weise würden meine Kenntnisse nicht missbräuchlich genutzt werden, aber dennoch verschwendet.

source: I would not be culpable for dividing and restricting computer users, but it would happen nonetheless.
de: Ich wäre zwar nicht Schuld an der Spaltung und Beschränkung von Rechnernutzern, aber es würde dennoch passieren.

source: So I looked for a way that a programmer could do something for the good.
de: Also suchte ich nach einem Weg, auf dem ein Programmierer etwas Gutes bewirken kann.

source: I asked myself, was there a program or programs that I could write, so as to make a community possible once again?
de: Ich fragte mich, ob es ein Programm oder Programme gab, das oder die ich schreiben könnte, um so noch einmal eine Gemeinschaft möglich zu machen.

source: The answer was clear: what was needed first was an operating system.
de: Die Antwort war klar: was zuerst erforderlich war, war ein Betriebssystem.

source: That is the crucial software for starting to use a computer.
de: Das ist die entscheidende Software, um anzufangen, einen Rechner zu benutzen.

source: With an operating system, you can do many things; without one, you cannot run the computer at all.
de: Mit einem Betriebssystem kann man viele Dinge machen, ohne kann man den Rechner überhaupt nicht benutzen.

source: With a free operating system, we could again have a community of cooperating hackers—and invite anyone to join.
de: Mit einem freien Betriebssystem könnten wir wieder eine Gemeinschaft von zusammenarbeitenden Hackern haben ‑ und jeden einladen, sich uns anzuschließen.

source: And anyone would be able to use a computer without starting out by conspiring to deprive his or her friends.
de: Und jedermann wäre in der Lage einen Rechner zu benutzen, ohne auf verschwörerische Weise zu beginnen seine oder ihre Freunde zu benachteiligen.

source: As an operating system developer, I had the right skills for this job.
de: Als Betriebssystementwickler hatte ich die richtigen Kenntnisse für diese Aufgabe.

source: So even though I could not take success for granted, I realized that I was elected to do the job.
de: Auch wenn ich den Erfolg nicht als garantiert ansehen konnte, wurde mir klar, dass ich auserwählt war diese Aufgabe zu übernehmen.

source: I chose to make the system compatible with Unix so that it would be portable, and so that Unix users could easily switch to it.
de: Ich entschied mich das System mit Unix kompatibel zu machen, damit es portabel wäre und Unix-Benutzer somit leichter umsteigen könnten.

source: The name GNU was chosen, following a hacker tradition, as a recursive acronym for “GNU's Not Unix.” It is pronounced as one syllable with a hard g.
de: Der Name GNU wurde, einer Hacker-Tradition folgend, als ein rekursives Akronym für GNU’s Not Unix (‚GNU ist nicht Unix‘) gewählt und wird [ˈgnuː] ausgesprochen.

source: An operating system does not mean just a kernel, barely enough to run other programs.
de: Ein Betriebssystem bedeutet nicht nur einen Betriebssystemkern ‑ kaum genug, um andere Programme auszuführen.

source: In the 1970s, every operating system worthy of the name included command processors, assemblers, compilers, interpreters, debuggers, text editors, mailers, and much more.
de: In den 1970ern umfasste jedes Betriebssystem, das diesen Namen verdiente, Befehlsinterpreter, Assembler, Compiler, Interpreter, Debugger, Texteditoren, E-Mail-Anwendungen und vieles mehr.

source: ITS had them, Multics had them, VMS had them, and Unix had them.
de: ITS, Multics, VMS und Unix hatten sie.

source: The GNU operating system would include them too.
de: Das GNU-Betriebssystem würde sie auch umfassen.

source: Later I heard these words, attributed to Hillel (1):
de: Später hörte ich diese Wörter, zurückgeführt auf Hillel[2]:

source: If I am not for myself, who will be for me?
de: „Wenn ich nicht für mich bin, wer wird für mich sein?

source: If I am only for myself, what am I?
de: Wenn ich nur für mich bin, was bin ich dann?

source: If not now, when?
de: Wenn nicht jetzt, wann?“

source: The decision to start the GNU Project was based on a similar spirit.
de: Der Entschluss, mit dem GNU-Projekt zu beginnen, beruhte auf einem ähnlichen Geist.

source: It is about freedom.
de: Es geht um Freiheit.

source: Here, therefore, is the definition of free software.
de: Hier deshalb die Freie-Software-Definition.

source: A program is free software, for you, a particular user, if: You have the freedom to run the program as you wish, for any purpose.
de: Ein Programm ist Freie Software, für Sie, einem besonderen Benutzer, wenn:

source: You have the freedom to modify the program to suit your needs. (To make this freedom effective in practice, you must have access to the source code, since making changes in a program without having the source code is exceedingly difficult.) You have the freedom to redistribute copies, either gratis or for a fee.
de: Sie die Freiheit haben, das Programm auszuführen wie Sie möchten, für jeden Zweck; Sie die Freiheit haben, das Programm an Ihre Bedürfnisse anzupassen (um diese Freiheit in der Praxis umzusetzen, muss man Zugang zum Quellcode haben, denn Programmänderungen ohne Quellcode sind außerordentlich schwierig); Sie die Freiheit haben, Kopien weiterzuverbreiten, entweder gratis oder gegen eine Gebühr; Sie die Freiheit haben, modifizierte Programmversionen zu distribuieren, damit die Gemeinschaft von Ihren Verbesserungen profitieren kann.

source: You have the freedom to distribute modified versions of the program, so that the community can benefit from your improvements.
de: Da sich frei auf Freiheit bezieht, nicht auf den Preis, gibt es keinen Widerspruch zwischen Freie Software und dem Verkauf von Kopien.

source: Since “free” refers to freedom, not to price, there is no contradiction between selling copies and free software. In fact, the freedom to sell copies is crucial: collections of free software sold on CD-ROMs are important for the community, and selling them is an important way to raise funds for free software development.
de: Tatsächlich ist die Freiheit, Kopien zu verkaufen, entscheidend: Sammlungen von auf CD-ROMs verkaufter freier Software sind für die Gemeinschaft wichtig und der Verkauf ein wichtiger Weg, um mehr in die Freie-Software-Entwicklung zu investieren.

source: Therefore, a program which people are not free to include on these collections is not free software.
de: Daher ist ein Programm, das man diesen Sammlungen nicht frei aufnehmen kann, keine freie Software.

source: Because of the ambiguity of “free”, people have long looked for alternatives, but no one has found a better term.
de: Aufgrund der Mehrdeutigkeit von frei hat man lange nach Alternativen gesucht, aber niemand hat einen besseren Begriff gefunden.

source: The English language has more words and nuances than any other, but it lacks a simple, unambiguous, word that means “free”, as in freedom—“unfettered” being the word that comes closest in meaning.
de: Die englische Sprache hat mehr Wörter und Nuancen als jede andere, aber es fehlt ein einfaches, eindeutiges Wort, das frei wie in Freiheit bedeutet ‑ uneingeschränkt ist ein Wort, das dieser Bedeutung am nächsten kommt.

source: Such alternatives as “liberated”, “freedom”, and “open” have either the wrong meaning or some other disadvantage.
de: Derartige Alternativen wie befreit, Freiheit und offen haben entweder die falsche Bedeutung oder einen anderen Nachteil.

source: GNU software and the GNU system Developing a whole system is a very large project.
de: GNU-Software und das GNU-System Die Entwicklung eines ganzen Systems ist ein sehr großes Projekt.

source: To bring it into reach, I decided to adapt and use existing pieces of free software wherever that was possible.
de: Um es erreichbar zu machen, beschloss ich, vorhandene Teile freier Software anzupassen und zu nutzen, wo immer das möglich war.

source: For example, I decided at the very beginning to use TeX as the principal text formatter; a few years later, I decided to use the X Window System rather than writing another window system for GNU.
de: Beispielsweise entschied ich mich gleich am Anfang hauptsächlich TeX als Textsatzsystem zu nutzen; einige Jahre später beschloss ich, das X Window System (X11) zu nutzen, anstatt ein anderes Fenstersystem für GNU zu schreiben.

source: Because of these decisions, and others like them, the GNU system is not the same as the collection of all GNU software.
de: Aufgrund dieser (und anderer ähnlicher) Entscheidungen ist das GNU-System nicht das Gleiche wie die Sammlung aller GNU-Software.

source: The GNU system includes programs that are not GNU software, programs that were developed by other people and projects for their own purposes, but which we can use because they are free software.
de: Das GNU-System umfasst Programme, die nicht GNU-Software sind, Programme, die von anderen Personen und Projekten für deren eigene Zwecke entwickelt wurden ‑ aber die wir verwenden können, weil sie freie Software sind.

source: Commencing the project In January 1984 I quit my job at MIT and began writing GNU software.
de: Der Anfang des Projekts Im Januar 1984 kündigte ich meinen Job am MIT und begann GNU-Software zu schreiben.

source: Leaving MIT was necessary so that MIT would not be able to interfere with distributing GNU as free software.
de: Das MIT zu verlassen war notwendig, damit es nicht in der Lage gewesen wäre, sich in den Vertrieb von GNU als freie Software einzumischen.

source: If I had remained on the staff, MIT could have claimed to own the work, and could have imposed their own distribution terms, or even turned the work into a proprietary software package.
de: Wäre ich als Mitarbeiter geblieben, hätte das MIT Anspruch auf die Arbeit selbst erheben, eigene Vertriebsbedingungen festlegen oder die Arbeit sogar in ein proprietäres Softwarepaket umwandeln können.

source: I had no intention of doing a large amount of work only to see it become useless for its intended purpose: creating a new software-sharing community.
de: Ich hatte nicht die Absicht eine Menge Arbeit zu erledigen, um dann zu sehen, wie sie für den eigentlichen Zweck nutzlos wird: das Schaffen einer neuen Software teilenden Gemeinschaft.

source: However, Professor Winston, then the head of the MIT AI Lab, kindly invited me to keep using the lab's facilities.
de: Allerdings lud mich Professor Winston, der damalige Leiter des MIT AI Lab, freundlicherweise ein, weiterhin die Einrichtung des Labors zu nutzen.

source: The first steps Shortly before beginning the GNU Project, I heard about the Free University Compiler Kit, also known as VUCK.
de: Die ersten Schritte Kurz vor Beginn des GNU-Projekts hörte ich vom Free University Compiler Kit, auch als VUCK bekannt (das niederländische Wort für frei fängt mit einem ‚v‘, für ‚vrij‘, an).

source: (The Dutch word for “free” is written with a v.) This was a compiler designed to handle multiple languages, including C and Pascal, and to support multiple target machines.
de: Das war ein Compiler, entwickelt, um mehrere Programmiersprachen, darunter C und Pascal, zu verarbeiten und mehrere Zielplattformen zu unterstützten.

source: I wrote to its author asking if GNU could use it.
de: Ich schrieb dem Autor und fragte, ob das Programm für GNU genutzt werden könne.

source: He responded derisively, stating that the university was free but the compiler was not.
de: Er antwortete spöttisch und gab an, dass die Universität frei wäre, nicht aber der Compiler.

source: I therefore decided that my first program for the GNU Project would be a multilanguage, multiplatform compiler.
de: Ich beschloss daher, dass mein erstes Programm für das GNU-Projekt ein mehrsprachiger, plattformübergreifender Compiler sein würde.

source: Hoping to avoid the need to write the whole compiler myself, I obtained the source code for the Pastel compiler, which was a multiplatform compiler developed at Lawrence Livermore Lab.
de: In der Hoffnung, nicht notwendigerweise den ganzen Compiler selbst neu schreiben zu müssen, erhielt ich schließlich den Quellcode des Pastel Compilers, einem plattformübergreifenden Compiler, der am Lawrence Livermore Laboratory entwickelt wurde.

source: It supported, and was written in, an extended version of Pascal, designed to be a system-programming language.
de: Er unterstützte nicht nur eine erweiterte Version von Pascal, sondern war auch in dieser als Systemprogrammiersprache geschrieben.

source: I added a C front end, and began porting it to the Motorola 68000 computer.
de: Ich fügte ein C-Frontend hinzu und begann die Portierung auf den Motorola 68000-Rechner.

source: But I had to give that up when I discovered that the compiler needed many megabytes of stack space, and the available 68000 Unix system would only allow 64k.
de: Als ich entdeckte, dass der Compiler mehrere Megabyte Stack-Speicher benötigte und das verfügbare 68000 Unix-System nur 64k erlauben würde, musste ich allerdings aufgeben.

source: I then realized that the Pastel compiler functioned by parsing the entire input file into a syntax tree, converting the whole syntax tree into a chain of “instructions”, and then generating the whole output file, without ever freeing any storage.
de: Dann fand ich heraus, dass der Pastel Compiler die gesamte Eingabedatei durch Analyse in einen Syntaxbaum umwandelte, den gesamten Syntaxbaum in eine Kette von Anweisungen umwandelte und dann die ganze Ausgabedatei generierte, ohne jemals irgendwelchen Speicher wieder freizugeben.

source: At this point, I concluded I would have to write a new compiler from scratch.
de: An diesem Punkt entschloss ich mich, einen neuen Compiler von Grund auf neu zu schreiben.

source: That new compiler is now known as GCC; none of the Pastel compiler is used in it, but I managed to adapt and use the C front end that I had written.
de: Dieser neue Compiler ist heute als GNU Compiler Collection (GCC) bekannt. Nichts vom Pastel Compiler wurde darin genutzt, aber ich schaffte es, das C-Frontend, welches ich geschrieben hatte, anzupassen und zu nutzen.

source: But that was some years later; first, I worked on GNU Emacs.
de: Aber das war erst einige Jahre später, zuerst arbeitete ich an GNU Emacs.

source: GNU Emacs I began work on GNU Emacs in September 1984, and in early 1985 it was beginning to be usable.
de: GNU Emacs Ich begann die Arbeit an GNU Emacs im September 1984, Anfang 1985 fing er an brauchbar zu werden.

source: This enabled me to begin using Unix systems to do editing; having no interest in learning to use vi or ed, I had done my editing on other kinds of machines until then.
de: Das ermöglichte mir für das weitere Schreiben Unix-Systeme zu nutzen.

source: At this point, people began wanting to use GNU Emacs, which raised the question of how to distribute it.
de: Kein Interesse habend die Verwendung von Vi oder Ed zu erlernen, hatte ich meine Bearbeitung bis dahin auf anderen Rechnern erledigt.

source: Of course, I put it on the anonymous ftp server on the MIT computer that I used.
de: Zu diesem Zeitpunkt begann man GNU Emacs nutzen zu wollen, was die Frage aufwarf, wie der Vertrieb aussehen sollte.

source: (This computer, prep.ai.mit.edu, thus became the principal GNU ftp distribution site; when it was decommissioned a few years later, we transferred the name to our new ftp server.) But at that time, many of the interested people were not on the Internet and could not get a copy by ftp.
de: Natürlich war er von einem anonymen FTP-Server des MIT, den ich nutzte, abrufbar (dieser Rechner, prep.ia.mit.edu, wurde daher zur wichtigsten FTP-Vertriebsseite von GNU. Als er ein paar Jahre später stillgelegt wurde, transferierten wir den Namen auf unseren neuen FTP-Server). Aber damals hatten viele Interessierte noch keinen Internetzugang und konnten keine Kopie per FTP abrufen.

source: So the question was, what would I say to them?
de: Also stellte sich die Frage, was ich ihnen sagen würde.

source: I could have said, “Find a friend who is on the net and who will make a copy for you.” Or I could have done what I did with the original PDP-10 Emacs: tell them, “Mail me a tape and a SASE, and I will mail it back with Emacs on it.” But I had no job, and I was looking for ways to make money from free software.
de: Ich hätte sagen können: „Finden Sie einen Freund, der im Netz ist und eine Kopie für Sie machen kann.“ Oder ich hätte gemacht, was ich mit dem ursprünglichen PDP-10 Emacs praktizierte: „Übersenden Sie mir ein Magnetband mit einem adressierten und frankierten Rückumschlag, und ich sende es mit Emacs darauf zurück.“ Aber ich hatte keine Anstellung und suchte nach Wegen, mit freier Software Geld zu verdienen.

source: So I announced that I would mail a tape to whoever wanted one, for a fee of $150.
de: Also kündigte ich an, jedem gegen eine Gebühr von 150 US-Dollar ein Magnetband zu senden.

source: In this way, I started a free software distribution business, the precursor of the companies that today distribute entire GNU/Linux system distributions.
de: Auf diese Weise begann ich einen geschäftlichen Vertrieb mit freier Software, dem Vorläufer der Unternehmen, die heute ganze GNU/Linux-Distributionen verbreiten.

source: Is a program free for every user?
de: Ist ein Programm für jeden Benutzer frei?

source: If a program is free software when it leaves the hands of its author, this does not necessarily mean it will be free software for everyone who has a copy of it.
de: Wenn ein Programm, wenn es die Hände des Autors verlässt, Freie Software ist, bedeutet dies nicht notwendigerweise, dass es für jedermann freie Software sein wird, die eine Kopie davon besitzen.

source: For example, public domain software (software that is not copyrighted) is free software; but anyone can make a proprietary modified version of it.
de: Beispielsweise ist Public-Domain-Software (Software, die nicht dem Urheberrecht unterliegt)[*] Freie Software, aber jeder kann eine proprietäre modifizierte Version davon erstellen.

source: Likewise, many free programs are copyrighted but distributed under simple permissive licenses which allow proprietary modified versions.
de: Ebenfalls sind viele freie Programme mit einem Copyright versehen, aber unter einfachen freizügigen Lizenzen, die proprietäre modifizierte Versionen ermöglichen.

source: The paradigmatic example of this problem is the X Window System.
de: Das paradigmatische Beispiel dieses Problems ist das X Window System (X11).

source: Developed at MIT, and released as free software with a permissive license, it was soon adopted by various computer companies.
de: Am MIT entwickelt und als Freie Software mit einer freizügigen Lizenz freigegeben, wurde es bald von verschiedenen Rechnerfirmen adaptiert.

source: They added X to their proprietary Unix systems, in binary form only, and covered by the same nondisclosure agreement.
de: Sie fügten X11 nur in binärer Form ihren proprietären Unix-Systemen hinzu ‑ mit einer Vertraulichkeitsvereinbarung.

source: These copies of X were no more free software than Unix was.
de: Diese X11-Kopien waren wie Unix keine freie Software mehr.

source: The developers of the X Window System did not consider this a problem—they expected and intended this to happen.
de: Die Entwickler von X11 betrachteten dies nicht als ein Problem ‑ sie erwarteten und beabsichtigten es sogar.
